In [1]:
import pandas as pd
import numpy as np

In [2]:
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
df = pd.read_excel("customer_churn_large_dataset.xlsx",sheet_name="Sheet1")

In [4]:
df.head()

,CustomerID,Name,Age,Gender,Location,Subscription_Length_Months,Monthly_Bill,Total_Usage_GB,Churn
0,1,Customer_1,63,Male,Los Angeles,17,73.36,236,0
1,2,Customer_2,62,Female,New York,1,48.76,172,0
2,3,Customer_3,24,Female,Los Angeles,5,85.47,460,0
3,4,Customer_4,36,Female,Miami,3,97.94,297,1
4,5,Customer_5,46,Female,Miami,19,58.14,266,0

In [5]:
df.drop(columns = ['CustomerID','Name'],inplace=True)

In [6]:
df.head()

,Age,Gender,Location,Subscription_Length_Months,Monthly_Bill,Total_Usage_GB,Churn
0,63,Male,Los Angeles,17,73.36,236,0
1,62,Female,New York,1,48.76,172,0
2,24,Female,Los Angeles,5,85.47,460,0
3,36,Female,Miami,3,97.94,297,1
4,46,Female,Miami,19,58.14,266,0

In [7]:
gender = {"Male":1,"Female":0}
location = {'Chicago':1,'Houston':2,'Los Angeles':3, 'Miami':4, 'New York':5}
df['Gender'] = df["Gender"].replace(gender)
df['Location'] = df['Location'].replace(location)

In [8]:
df.head()

,Age,Gender,Location,Subscription_Length_Months,Monthly_Bill,Total_Usage_GB,Churn
0,63,1,3,17,73.36,236,0
1,62,0,5,1,48.76,172,0
2,24,0,3,5,85.47,460,0
3,36,0,4,3,97.94,297,1
4,46,0,4,19,58.14,266,0

In [42]:
def remove_outliers_iqr(data):
    # Calculate the first quartile (Q1) and third quartile (Q3)
    q1 = np.percentile(data, 25)
    q3 = np.percentile(data, 75)
    
    # Calculate the IQR (Interquartile Range)
    iqr = q3 - q1
    
    # Define the lower and upper bounds to identify outliers
    lower_bound = q1 - 1.5 * iqr
    upper_bound = q3 + 1.5 * iqr
    
    # Filter the data to remove outliers
    filtered_data = [x for x in data if (x < lower_bound) and (x > upper_bound)]
    
    return filtered_data

In [49]:
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split

In [50]:
X = df.drop(['Churn'],axis = 1).values
y = df['Churn'].values

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=40)

In [51]:
scaler = StandardScaler()

In [53]:
X_train_scaled = scaler.fit_transform(X_train)
X_test_scaled = scaler.transform(X_test)

In [58]:
from sklearn.ensemble import RandomForestClassifier
rf = RandomForestClassifier()

In [59]:
rf.fit(X_train_scaled,y_train)

RandomForestClassifier()

In [60]:
y_pred = rf.predict(X_test)

In [63]:
from sklearn.metrics import confusion_matrix,f1_score

In [62]:
confusion_matrix(y_test,y_pred , normalize='true')

array([[0.04431078, 0.95568922],
       [0.04468828, 0.95531172]])

In [64]:
f1_score(y_test,y_pred)

0.6574223442594817